# install.packages("UsingR") - инсталиране на пакет UsingR
# library("UsingR") - зареждане на вече инсталиран пакет UsingR
# ls() - променливи със зададено значение в текущата среда
# Ctrl+L - изчиства конзолата

# x=c(2,3,4,5,6,7,8) - създаване на вектор x = [2,3,4,5,6,7,8]
# x[i:j] - подмножество от i до j
# x[-i] - изключваме i-тия елемент
# x[-(i:j)] - подмножество без елементите от i до j

# x=c(x1,x2) - конкатенация на векторите x1 и x2
# which(x==value) - връща на кои индекси се среща стойността

# mean(x) - средно аритметично?
# range(x) - min(x) max(x)
# cumsum(c(a1,a2,a3)) = [a1, a1+a2, a1+a2+a3]

# matrix(data, nrow, ncol, byrow = TRUE)
# matrix[i,j] - достъп до елемент на ред i колона j
# matrix[i,] - взимаме ред i
# matrix[,j] - взимаме колона j
# matrix = cbind(matrix,c(4,4,4)) - добавяме нова колона в матрицата
# matrix = rbind(matrix,c(4,4,4)) - добавяме нов ред в матрицата

# dim(matrix) - размерности на матрицата
# nrow(matrix) - брой редове
# ncol(matrix) - брой колони
# diag(matrix) - връща вектор с диагонала на матрицата

# ЗАДАЧА 1
# v=matrix(c("a","b","c","2","2","3"),TRUE) създава матрица с 1 ред и 6 колони

# ЗАДАЧА 2
# rep(element, times) - повтаря елементът даденият брой пъти

mat1 <- matrix(1:6, 2)
mat2 <- matrix(c(rep(1, 3), rep(2, 3)), 2, byrow = T)

solve(mat1[,2:3]) # намира ОБРАТНАТА матрица на зададената квадратна матрица

mat1 * mat2 # Element-wise multiplication, тоест всеки елемент се умножава със съответстващия му в другата матрица

mat1 %*% t(mat2) # Matrix multiplication, в случая умножаваме първата матрица с транспонираната втора матрица

# ЗАДАЧА 3
x = c(8,3,8,7,15,9,12,4,9,10,5,1)
a = matrix(x, 6, 2)
colnames(a) = c("c1", "c2")
max(a)
min(a)
a = rbind(a,runif(2,1,20))
a[,2] = a[,2]*2
b = matrix(rep(6,nrow(a)*ncol(a)),nrow(a))
a = a + b


