# install.packages("UsingR") - инсталиране на пакет UsingR
# library("UsingR") - зареждане на вече инсталиран пакет UsingR

# x=c(2,3,4,5,6,7,8) - създаване на вектор x = [2,3,4,5,6,7,8]
# x[i:j] - подмножество от i до j
# x[-i] - изключваме i-тия елемент
# x[-(i:j)] - подмножество без елементите от i до j

# x=c(x1,x2) - конкатенация на векторите x1 и x2
# which(x==value) - връща на кои индекси се среща стойността

# mean(x) - средно аритметично?
# range(x) - min(x) max(x)
# cumsum(c(a1,a2,a3)) = [a1, a1+a2, a1+a2+a3]

